Конфигурация/Documents/РасходДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Document>
		<Properties>
			<Name>РасходДенег</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расшифровка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСтатьи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Суммы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяДДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/РасходДенег/Forms/ФормаДокумента/Ext/Form/Module.bsl
// КЛИЕНТСКИЕ ПРОЦЕДУРЫ И ФУНКЦИИ //

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ЗаписьДокумента");
КонецПроцедуры

&НаКлиенте
Процедура КошелекПриИзменении(Элемент)
	ПриИзмененииКошелька();
КонецПроцедуры

&НаКлиенте
Процедура ДолгПриИзменении(Элемент)
	ОбновитьПредставления();
	Если Не Объект.Долг Тогда
		Объект.Контрагент = Неопределено;
	КонецЕсли;	
КонецПроцедуры

// СЕРВЕРНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ //

&НаСервере
Процедура ПриИзмененииКошелька ()
	ВалютаКошелька = Объект.Кошелек.Валюта;
	ОбновитьПредставления();
КонецПроцедуры	

&НаСервере
Процедура ОбновитьПредставления ()
	Если ОсновнаяВалюта <> Объект.Кошелек.Валюта Тогда
		Элементы.ГруппаКурсКратность.Видимость = Истина;
		КурсКратность = ОбщийМодульСервер.ПолучитьКурсКратностьВалюты(Объект.Кошелек.Валюта, Объект.Дата); 
		ЗаполнитьЗначенияСвойств(Объект,КурсКратность);
	Иначе
		Курс      = 1;
		Кратность = 1;
		Элементы.ГруппаКурсКратность.Видимость = Ложь;
	КонецЕсли;	                                       	
	Элементы.Контрагент.Доступность = Объект.Долг;
КонецПроцедуры	

// ИНИЦИАЛИЗАЦИЯ ДОКУМЕНТА //

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		РЕЗ = ОбщийМодульСервер.ПолучитьЗначенияПоУмолчанию(РеквизитФормыВЗначение("Объект").Метаданные().ПолноеИмя(),"Кошелек,СтатьяДДС");
		ЗаполнитьЗначенияСвойств(Объект,Рез);
		НоваяСтрока = Объект.Суммы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Рез);	
	КонецЕсли; 
	ОсновнаяВалюта = Константы.ОсновнаяВалюта.Получить();
	ВалютаКошелька = Объект.Кошелек.Валюта;
	ОбновитьПредставления();
	
	НастройкаФормСервер.НастройкаПриСозданииФормы(ЭтаФорма,Объект,"Суммы");
КонецПроцедуры

// УПРАВЛЕНИЕ ФОРМОЙ //

// КЛИЕНТСКИЕ ПРОЦЕДУРЫ //

&НаКлиенте
Процедура ДобавитьСтроку(Команда)
	НоваяСтрока     = Объект.Суммы.Добавить();
	НоваяСтрока.УИД = СтрЗаменить(Строка(Новый УникальныйИдентификатор),"-","_");
	СоздатьОбновитьЭлементыФормы();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	УИД = СтрЗаменить(Команда.Имя,"Удалить_","");
	УдалитьЭлементыСтроки(УИД);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизита (Элемент)
	НастройкаФормКлиент.ПриИзмененииРеквизита(ЭтаФорма,Объект,"Суммы",Элемент);
КонецПроцедуры	

// СЕРВЕРНЫЕ ПРОЦЕДУРЫ //

&НаСервере
Процедура СоздатьОбновитьЭлементыФормы ()
	НастройкаФормСервер.СоздатьОбновитьЭлементыФормы(ЭтаФорма,Объект,"Суммы");
КонецПроцедуры	

&НаСервере
Процедура УдалитьЭлементыСтроки (УИД)
	НастройкаФормСервер.УдалитьЭлементыСтроки(ЭтаФорма,Объект,"Суммы",УИД);
КонецПроцедуры
